# ProductShortDescription Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ProductShortDescription Property
FabricationPart Class See Also
---
The product short description of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string ProductShortDescription { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProductShortDescription As String
	Get
```

Visual C++
---
```text
public:
property String^ ProductShortDescription {
	String^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace